;-----------------------------------------------------------------------------;ЛР №1.2 Кодування Кіріліца Windows-1251
;-----------------------------------------------------------------------------;----------------I.ЗАГОЛОВОК ПРОГРАМИ-----------------------
IDEAL
MODEL SMALL
STACK 512
;-----------------------II.МАКРОСИ-------------------------------------; Складний макрос для ініціалізації
MACRO M_Init
; Початок макросу
mov ax, @data ; ax <- @data
mov ds, ax ; ds <- ax
mov es, ax ; es <- ax
ENDM M_Init

MACRO M_Incre
	add bx, 10h
	sub si, 1h
ENDM M_Incre
;--------------------III.ПОЧАТОК СЕГМЕНТУ ДАНИХ-------------
DATASEG
;Оголошення двовимірного експериментального масиву 16х16
array2Db db 7, 8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8
         db 8, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,8
         db 8, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,8
         db 8, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,8
         db 8, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,8
		 db 8, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,8
         db 8, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,8
         db 8, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,7
         db 7, 0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,0 ,8
         db 8, 7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7 ,8 ,7

exCode DB 0
CODESEG
;----------------------VI. ПОЧАТОК СЕГМЕНТУ КОДУ------------------
Start:
M_Init
mov bx, 70h
mov si, 0eh
;Способи адресації по Рудакову-Фiногенову----------------------

; 1. Пряме звернення до пам’яті з відомою абсолютною адресою

;Дуже небезпечний механізм. Проте дає повну владу над кодом.
;Маємо сьомий варіант, отже діагональ починається з правого верхнього кута
;І її початок зміщено на 7 рядків донизу
mov al,"K" ; В ах записується символ
mov [bx+si], al
M_Incre
mov al,"N"
mov [bx+si], al
M_Incre
mov al,"R"
mov [bx+si], al 
M_Incre
mov al,"B"
mov [bx+si], al 
M_Incre
mov al,"S"
mov [bx+si], al 
M_Incre
mov al,"I"
mov [bx+si], al 
M_Incre
mov al,"K"
mov [bx+si], al 
M_Incre
mov al,"V"
mov [bx+si], al
M_Incre
mov al,"O"
mov [bx+si], al

Exit:
    mov ah,4ch
    mov al,[exCode]
  int 21h
  end Start