TITLE ЛР_4 
;------------------------------------------------------------------------------
;ЛР  №4
;------------------------------------------------------------------------------
; Програмування 3. Системне програмування
; Завдання:              Основи розробки і налагодження
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:                1
; Група:       ІТ-03
;------------------------------------------------------------------------------
; Автор:        Бойко Карванський Карпов
;---------------------------------
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 1024		; Директива - розмір стеку 

DATASEG
array_stack dw 2E2Eh, 2098, 6847, 7230, 5182, 1964, 7350, 1628, 9823, 5927, 2343, 7515, 5238, 8272, 6576, 2619
            dw 9520, 6608, 5535, 9745, 8314, 1683, 2065, 3718, 3198, 5267, 1546, 2273, 9317, 2181, 7466, 1940
            dw 7417, 2385 ,2240 ,8346, 9246, 9573, 5050, 1549, 4402, 7854 ,8126 ,9060 ,3476 ,7497 ,3703, 1857
            dw 8794, 8017, 3227, 1033, 7980, 8658, 6475, 2653, 4970, 3343, 3788, 4600, 4953, 5156 ,7128, 9539
            dw 4889, 8734 ,8685 ,3104 ,5514 ,9721 ,5958 ,4611 ,7759 ,1725, 6059 ,7499 ,9681 ,4573 ,6929 ,1387
            dw 2772, 5484 ,7392 ,8250 ,5503 ,6080 ,1249, 3413, 3167, 9250 ,7496 ,7533 ,2101, 4007, 6810, 4531
            dw 4979, 9050, 8589, 6962, 5374 ,3451 ,2971, 6612, 8002, 4074, 2634, 3694, 7979, 7571 ,7333, 9852
            dw 9847, 3270 ,2426 ,6722, 2697 ,9765 ,2203 ,3222 ,6819 ,5024 ,5846 ,3619 ,9626 ,2638 ,4465, 2E2Eh
            
birthday1 db "02.07.2003"
birthday2 db "04.10.2002"
birthday3 db "09.10.2002"
            

CODESEG
Start:
    mov ax, @data ; ініціалізація дата сегменту
    mov ds, ax
    mov es, ax

    mov cx, 128 ; кількість повторів =  128, оскільки копіюємо по 2 байти
    xor si, si ; обнуляємо значення
    l1:
        mov ax, [ds:si]
        mov [ds:[si+130h]],ax ; занесення значення до датасегменту
        mov [ds:[si+240h]],ax
        mov [ds:[si+350h]],ax
        add si,2                        ;збільшення значення в регістрі si
        loop l1                         ;перевірка циклу


                                        ;розрахувати розмір стеку
                                        ;мінімально необхідний розмір стеку = розміру масиву, в нашому випадку 256 значень = 256 байтів
                                        ;заносимо одразу по 2 байта, тому пробігаємо лише 128 разів
    mov cx, 128
    xor si, si                          ; обнуляєм значення
    l2:
        mov ax,[ds:[si]]; занесення значення з ділянки в ds до ax
        push ax ;занесення значення з ax до стеку
        add si, 2  ;збільшення значення в регістрі si на 2, оскільки записано 2 байти 
        loop l2 ;перевірка циклу

    ;наш розмір стеку 1024 = 0400h, в нього записано 256 байтів
    ;отже показчик sp стоїть на 0300h, а 4 рядок  знаходиться в ss:0330h

    ;02.07.2003, 4 рядок
    mov bp, 0330h
    xor si,si ;обнуляємо si
    mov cx,10 ;к-ть повторів
    birt1:
        mov ah, [birthday1+si] 
        mov [bp], ah ;занесення до стеку
        inc si ;інкр si
        inc bp ;інкр bp
        loop birt1 

    mov bp, 0320h
    xor si,si
    mov cx,10 

    ;04.10.2002, 3 рядок
    birt2:
        mov ah, [birthday2+si]
        mov [bp], ah
        inc si
        inc bp
        loop birt2

    mov bp, 0310h
    xor si,si
    mov cx,10 

    ;09.10.2002, 2 рядок
    birt3:
        mov ah, [birthday3+si]
        mov [bp], ah
        inc si
        inc bp
        loop birt3    

    

    mov ah, 4ch
    int 21h 
end Start