IDEAL	;тип асемблера TASM
MODEL small	;модель пам’яті
stack 256	;розмір стеку

DATASEG  ;сегмент DATA
exCode db 0
message db "Boyko Stanislav",10,13, "Karvanskyi Nestor",10,13, "Karpov Vladislav",10,13,'$' ;текст для виведення

CODESEG  ;сегмент коду
Start:
					;ініціалізація ds і es
	mov ax,@data  ;@data ідентифікатор, що створюються директивою model
	mov ds, ax	;завантаження початку сегменту даних в регістр ds
	mov es, ax	;завантаження початку сегменту даних в регістр es
					;вивід строк на консоль
	mov dx, offset message	;пересилання адреси рядка символів message в регістр dx
	mov ah,9  ;завантаження числа 9 до регістру ah
	int 21h  ;вивід строки у консоль викликом команди 09h
					;прописуємо очікування вводу
	mov ah,01h  ;завантаження числа 01h до регістру ah
	int 21h  ;”активуємо” очікування вводу, виконуване командою 01h
					;вихід з програми
	mov ah,4ch  ;завантаження числа 4ch до регістру ah
	mov al,[exCode]  ;отримання коду виходу
	int 21h  ;виклик функції DOS 4ch
	end Start
